#+TITLE:manuscript template
#+AUTHOR: Ivan Hanigan
#+email: ivan.hanigan@anu.edu.au
-----

* run markdown 
#+name:manuscript_template
#+begin_src R :session *R* :tangle manuscript_template.Rmd :exports none :eval yes

  setwd("~/Dropbox/tools/LaTeX templates/manuscript_template")      
  library(rmarkdown)
  library(knitr)
  library(knitcitations)
  library(bibtex)
  cleanbib()
  # Takes long time to read mendeley bib so set to only do this if bib is note present
  # add new citation to mendeley requires re-reading that bib, so remove it
  # rm("bib")
  cite_options(citation_format = "pandoc", check.entries=FALSE)
   
  rmarkdown::render("manuscript_template.Rmd", "pdf_document")
  # browseURL("manuscript_template.pdf")
  
  #rmarkdown::render("manuscript_template.Rmd", "html_document")  
  # browseURL("manuscript_template.html")

#+end_src

#+RESULTS: manuscript_template
: /home/ivan_hanigan/Dropbox/tools/LaTeX templates/manuscript_template/manuscript_template.pdf

